In [2]:
### Missing data is common in most data analysis applications.

### Pandas makes workign with missing data painless as possible
### For example, all of the descriptive statistics on pandas objects exclude missing data. 
### Pandas uses NaN(the floating point value) to represent missing data in both floating as well as in non-floating point arrays.
### It is just used as a sentinel that can be easily detected.

### The built-in Python "None" is also treated as NA in object arrays

In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series([None, "art", np.nan, "music"])

In [5]:
string_data

0     None
1      art
2      NaN
3    music
dtype: object

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
### Panda's NA representation is not the best option; optimal -- but it is simple and reasonably consistent
### In some ways, it's the best solution, with a good all-around performance characterisitcs and a simple API
### that we could concoct in the absence of a true NA data type or bit pattern in Numpy's data types.

In [8]:
### There are a number of ways by which we can filter out missing data.

s = pd.Series([1, np.nan, 4.5, np.nan, 7])

In [9]:
s

0    1.0
1    NaN
2    4.5
3    NaN
4    7.0
dtype: float64

In [10]:
s.dropna()

0    1.0
2    4.5
4    7.0
dtype: float64

In [11]:
s

0    1.0
1    NaN
2    4.5
3    NaN
4    7.0
dtype: float64

In [12]:
### As you can see, dropna() can be used to drop na values

In [13]:
### Note:- Instead of using np.nan all the time, we could say "from numpy import nan as NA" and then use NA in these places

In [14]:
### ALternate way of computing the same output through boolean indexing
s[s.notnull()]

0    1.0
2    4.5
4    7.0
dtype: float64

In [15]:
### With DF, this dropping option is a bit more complex.
### You may wanna drop whole rows or columns which are all NA or just those containing any NAs.
### dropna by default drops any row or column that contains a missing value

In [16]:
from numpy import nan as na
df = pd.DataFrame([[1,na,4,6.5], [1,3,4,5], [na,na,na,na]])

In [17]:
df

     0    1    2    3
0  1.0  NaN  4.0  6.5
1  1.0  3.0  4.0  5.0
2  NaN  NaN  NaN  NaN

In [18]:
cleaned = df.dropna()

In [19]:
cleaned

     0    1    2    3
1  1.0  3.0  4.0  5.0

In [20]:
### Passing how='all' will only drop rows that are all NA

cleaned_how = df.dropna(how='all')

In [21]:
cleaned_how

     0    1    2    3
0  1.0  NaN  4.0  6.5
1  1.0  3.0  4.0  5.0

In [22]:
### Dropping columns in the same way is only a matter of passing axis=1

In [23]:
cleaned_rows = df.dropna(axis=1)

In [24]:
cleaned_rows

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [25]:
### Since all the columns had at least one NA, theu were all dropped

In [26]:
cleaned_rows_how = df.dropna(axis=1, how='all')

In [27]:
cleaned_rows_how

     0    1    2    3
0  1.0  NaN  4.0  6.5
1  1.0  3.0  4.0  5.0
2  NaN  NaN  NaN  NaN

In [28]:
df1 = pd.DataFrame(np.random.randn(7,3))

In [29]:
df1

          0         1         2
0 -0.117769  0.168863 -1.280500
1 -0.611523 -0.072595 -0.613640
2 -0.523562  0.484513 -0.858051
3  1.212188  0.656229 -0.075853
4  1.810879 -0.150426  0.589977
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [30]:
df1.ix[:3,2] = na

In [31]:
df1

          0         1         2
0 -0.117769  0.168863       NaN
1 -0.611523 -0.072595       NaN
2 -0.523562  0.484513       NaN
3  1.212188  0.656229       NaN
4  1.810879 -0.150426  0.589977
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [32]:
df1.ix[:4,1] = na

In [33]:
df1

          0         1         2
0 -0.117769       NaN       NaN
1 -0.611523       NaN       NaN
2 -0.523562       NaN       NaN
3  1.212188       NaN       NaN
4  1.810879       NaN  0.589977
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [40]:
### The thresh argument can help us filter out missing values and keep only rows that meet the criterion of minimum number of
### valid observations.

### For example in the DF above, if you wanna show only the rows that have at least 2 valid observations, we do this

df1.dropna(thresh=2)

          0         1         2
4  1.810879       NaN  0.589977
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [41]:
### if we say, thersh=3, only the last 2 rows are gonna be displayed

df1.dropna(thresh=3)

          0         1         2
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [42]:
### But if you wanna fill in these holes rather blatabtly disregarding other data along with the missing values,
### we may want to employ other techniques.

### fillna is one useful method.

df1.fillna(0)

          0         1         2
0 -0.117769  0.000000  0.000000
1 -0.611523  0.000000  0.000000
2 -0.523562  0.000000  0.000000
3  1.212188  0.000000  0.000000
4  1.810879  0.000000  0.589977
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [43]:
### Calling fillna with a dict, you can use a different fill value for each column.

In [48]:
df1

          0         1         2
0 -0.117769  0.000000  0.000000
1 -0.611523  0.000000  0.000000
2 -0.523562  0.000000  0.000000
3  1.212188  0.000000  0.000000
4  1.810879  0.000000  0.589977
5 -1.767124 -0.847430  1.915654
6  0.356986  0.363063  0.597952

In [49]:
df2 = pd.DataFrame(np.random.randn(6,3))

In [50]:
df2

          0         1         2
0  0.028983  0.711234 -0.834023
1 -1.730975  1.444598  1.424208
2 -0.335022 -0.065755  0.406654
3  1.072401 -0.466676 -1.226113
4  1.895157  0.728306 -0.790372
5 -0.368315 -0.499319  1.374375

In [51]:
df2.ix[3:,1] = na

In [52]:
df2.ix[4:,2] = na

In [53]:
df2

          0         1         2
0  0.028983  0.711234 -0.834023
1 -1.730975  1.444598  1.424208
2 -0.335022 -0.065755  0.406654
3  1.072401       NaN -1.226113
4  1.895157       NaN       NaN
5 -0.368315       NaN       NaN

In [54]:
### The same interpolation methods available for reindexing can be used with fillna

df2.fillna(method='ffill')

          0         1         2
0  0.028983  0.711234 -0.834023
1 -1.730975  1.444598  1.424208
2 -0.335022 -0.065755  0.406654
3  1.072401 -0.065755 -1.226113
4  1.895157 -0.065755 -1.226113
5 -0.368315 -0.065755 -1.226113

In [55]:
### The missing values have been replaced with the last available valid element

In [56]:
### You can also specify a limit for the forward fill.

df2.fillna(method='ffill', limit=2)

          0         1         2
0  0.028983  0.711234 -0.834023
1 -1.730975  1.444598  1.424208
2 -0.335022 -0.065755  0.406654
3  1.072401 -0.065755 -1.226113
4  1.895157 -0.065755 -1.226113
5 -0.368315       NaN -1.226113

In [58]:
df2[1]

0    0.711234
1    1.444598
2   -0.065755
3         NaN
4         NaN
5         NaN
Name: 1, dtype: float64

In [59]:
df2[1].mean()

0.6966924891663896

In [60]:
### You can be a little creative as well, such as filling in the missing values with the mean

In [61]:
df2[1].fillna(df2[1].mean())

0    0.711234
1    1.444598
2   -0.065755
3    0.696692
4    0.696692
5    0.696692
Name: 1, dtype: float64